{
   "configs" : [
      {
         "description" : "Ascendant in Aries",
         "effect" : "If the Ascendant falls in Aries, the native will have round eyes. His knees will be weak and he will have aggressive temperament but he will be afraid of water. He will be active and will always be moving about. His limbs will be bruised. He will eat sparigly and will be passionate. He will speak falsehoods.",
         "rule" : "return getRasi( Ascendant ) == Aries;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Taurus",
         "effect" : "The person born with Taurus as the Ascendant, will have plumply thighs and a big face. He will be engaged in agricultural ventures. He will be happy in the middle and last portions of his life. He will be fond of enjoying young women. He will be of sacrificing and forgiving nature, will be capable of endowing hardships and will possess cattle. He will have marks or moles on the back, face and sides.",
         "rule" : "return getRasi( Ascendant ) == Taurus;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Gemini",
         "effect" : "When the Ascedant is Gemini, the native will have balck eyes and curly hair. He will enjoy association with women and will have thick neck and many friends. He will be intelligent and mind reader. His nose will be elevated and he will be fond of music and dancing. He will like to remain indoors.",
         "rule" : "return getRasi( Ascendant ) == Gemini;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Cancer",
         "effect" : "Person with Cancer as the Ascendant will be henpacked. He will have a thick neck and will be fond of making friendships. He will possess many houses and will be wealthy. His waist will be thick but he will be short statured. He will be intelligent and fond of watery sports like swimming etc. He will walk fast and will have few sons. He will be crooked.",
         "rule" : "return getRasi( Ascendant ) == Cancer;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Leo",
         "effect" : "A person whose Ascendant is Leo will have reddish eyes, large chin and broad face. He will be arrogant, Powerful valiant, firm minded and obedient to his mother. He will be fond of roaming about in forests and hills. He will get angry on trifles.",
         "rule" : "return getRasi( Ascendant ) == Leo;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Virgo",
         "effect" : "The person born with Virgo as the Ascendant, will be truthful and will speak kindly. His eyes will be full of bashfulness and will be immediately liked by others. He will be well versed in Shastras and will take advantage of other people's houses and wealth. His arms and shoulders will be drooped and will possess few sons.",
         "rule" : "return getRasi( Ascendant ) == Virgo;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Libra",
         "effect" : "If the Ascendant be Libra, the person born will rever gods, and Brahmins but he will be active and will possess a lean and thin body. He will be tall in stature, deft in trading, patient and intent on being first. He will often have two names. He will have few children and he will be fond of wandering. He will be brave, merciless and impartial In his arguments.",
         "rule" : "return getRasi( Ascendant ) == Libra;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Scorpio",
         "effect" : "The person with Scorpio Ascendant at birth, will have rounded thighs and knees. His chest will be broad and eyes expansive. He will suffer from diseases from an early age. He will beseperated from his parents and preceptor. He will indulge In cruel actions and will be honoured by the king. His feet will bear marks of lotus.",
         "rule" : "return getRasi( Ascendant ) == Scorpio;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Sagittarius",
         "effect" : "The person with Sagittarius Ascendant at birth — His face and neck will be long and his nose and ears will be big. He will always keep himself engaged in some work or the other. He will be eloquent in speech and self sacrificing. He will have a short stature. He will be courageous and will overcome his enemies. He will be wealthy and favourite of the king. He can be won over by persuation and kindness.",
         "rule" : "return getRasi( Ascendant ) == Sagittarius;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Capricorn",
         "effect" : "When Capricorn is the Ascendant at birth, his lower limbs will be weak. He will have vitality. He will accept other people's advice but will be lazy by nature. He will indulge in affairs with old women of the forbidden category. He will be a religious hypocrite. He will be fond of wandering. He will be fortunate but shameless. He will suffer from wind-diseases.",
         "rule" : "return getRasi( Ascendant ) == Capricorn;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Aquarius",
         "effect" : "The person at whose birth Aquarius is the Ascendant, will commit sinful actions secretly. He will have little wealth, will be greedy and eager to usurp or utilise other people's money. He will endure long marches on road and will be clever in causing hurt to others. He will have a body like a water pot. He will be fond of perfumes and flowers. His financial position will be of a fluctuating nature.",
         "rule" : "return getRasi( Ascendant ) == Aquarius;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      },
      {
         "description" : "Ascendant in Pisces",
         "effect" : "The Pisces ascendant native will have a beautiful and symmetrical body. His eyes will be very attractive. He will be learned, grateful, satisfied with his wife and fortune. He will have financial gains from selling produce of the seas. He will overcome his enemies.",
         "rule" : "return getRasi( Ascendant ) == Pisces;",
         "highervargas" : true,
         "source" : "Phala Deepika",
         "group" : "Ascendant"
      }
   ]
}
