{
	"configs" : [
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Mars-Mars",
				"lord" : "Mars",
				"sublord" : "Mars",
				"effect" : "Effects, like gains of wealth by the beneficence of the king, beneficence of Goddess Lakshmi, recovery of a lost kingdom and of wealth, birth of a son, will arise in the Antardasa of Mars in his own Dasa, if he is in a Kendra, in Putr, in Dharm, in Labh, in Sahaj, or in Dhana, or be associated with the Lord of Lagn.
Fulfillment of ambitions by the beneficence of the king and acquisition of a house, land, cow, buffalo etc. will be the effects, if Mars is in his exaltation, in his own Rasi, or in his own Navamsa and is endowed with strength.
Urinary troubles, wounds, danger from snakes and the king will be the results, if Mars is in Randhra, or Vyaya, or is associated with, or receives a Drishti from malefics.
There will be mental agony and body pains, if Mars is the Lord of Dhana, or Yuvati. Lord Shiva will give relief by restoring health and providing gains of wealth and happiness, if the person concerned performs Rudr Japa and gives a red-coloured bull in charity."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Mars-Rahu",
				"lord" : "Mars",
				"sublord" : "Rahu",
				"effect" : "Effects, like recognition from government, gain of house, land etc., happiness from son, extraordinary profits in business, bathing in holy rivers, like Ganges and foreign journeys, will be the auspicious effects in the Antardasa of Rahu in the Dasa of Mars, if Rahu is in his Multrikon, in his exaltation Rasi, in a Kendra, in Labh, Putr, or Dharm and is associated with benefics.
Danger from snakes, wounds, destruction of cattle, danger from animals, diseases, due to imbalance of bile and wind, imprisonment etc. will be the results, if Rahu is in Randhra, or Vyaya, or receives a Drishti from, or is associated with malefics. There will be loss of wealth, if Rahu is in Dhana and great danger of premature death, if he is in Yuvati. The remedial measure to be adopted to obtain relief from the above evil effects are Naga Puja, offering food to Brahmins and Mrityunjaya Japa. They will help in the prolongation of longevity."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Mars-Jupiter",
				"lord" : "Mars",
				"sublord" : "Jupiter",
				"effect" : "Effects, like good reputation and renown, honours by government, increase in wealth and grains, happiness at home, gain of property, happiness from wife and children etc. will be realized in the Antardasa of Jupiter in the Dasa of Mars, if Jupiter is in Dharm, or Putr, in a Kendra, or in Labh, or in Dhana, or, if Jupiter is in his exalted, or own Navamsa.
Acquisition of a house, land, well-being, gain of property, sound health, good reputation, gains of cattle, success in business, happiness to wife and children, reverence from government, gain of wealth etc. will be beneficial effects, if Jupiter is in a Kendra, in a Trikona, or in the 11th from the Lord of the Dasa, or, if Jupiter is associated with the Lord of Dharm, Karm, or Bandhu, or Lagn, or, if Jupiter is in a benefic Navamsa etc.
Danger from thieves, snakes, wrath of the king, bilious diseases, oppression by goblins (Prot), loss of servants and co-borns, will be evil effects, if Jupiter is in Ari, Randhra, or in Vyaya, or, if Jupiter is in his debilitation Rasi, or, if Jupiter is associated with, or receives a Drishti from malefics, or, if Jupiter is otherwise weak. There will be suffering from fever, or danger of premature death, if Jupiter is the Lord of Dhana. The remedial measure to be adopted to combat the above evil effects is recitation of Shiva Sahasranam."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Mars-Saturn",
				"lord" : "Mars",
				"sublord" : "Saturn",
				"effect" : "Effects, like recognition from the king, increase in reputation, gain of wealth and grains, happiness from children and grandchildren, increase in the number of cows etc. will be experienced in the Antardasa of Saturn in the Dasa of Mars, if Saturn is in a Kendra, in a Trikona, in his Multrikon, in his exalted, or his own Navamsa, or, if Saturn is associated with the Lord of Lagn, or, if Saturn is associated with benefics. Results will generally fructify on Saturdays in the month of Saturn.
Danger from Yavana kings (foreign dignitaries), loss of wealth, imprisonment, possibility of affliction with diseases, loss in agricultural production will result, if Saturn is in his debilitation Rasi, or in an enemy Rasi, or, if Saturn is in Randhra, or in Vyaya.
Effects, like great danger, loss of life, wrath of king, mental agony, danger from thieves and fire, punishment by the king, loss of co-borns, dissensions amongst members of the family, loss of cattle, fear of death, distress to wife and children, imprisonment etc. will be felt, if Saturn is Dhana’s, or Yuvati’s Lord and is associated with malefics.
There will be journeys to foreign lands, loss of reputation, violent actions, loss from sale of agricultural lands, loss of position, agony, defeat in battle, urinary troubles etc., if Saturn is in a Kendra, in the 11th, or in the 5th from the Lord of the Dasa.
Effects, like death, danger from the king and thieves, rheumatism, pains, danger from the enemy and members of the family, will be experienced, if Saturn is in the 8th, or the 12th from the Lord of the Dasa and is associated with malefics. There will be relief from the evil effects by the beneficence of Lord Shiva, if Mrityunjaya is performed in the prescribed manner."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Mars-Mercury",
				"lord" : "Mars",
				"sublord" : "Mercury",
				"effect" : "Effects, like association with pious and holy persons, performance of Ajaya Japa, charities, observance of religious rites, gain of reputation, inclination towards diplomacy, availability of sweetish preparations, acquisition of conveyances, clothes and cattle etc., conferment of authority in the king’s retinue, success in agricultural projects etc., will be experienced in the Antardasa of Mercury in the Dasa of Mars, if Mercury is in a Kendra, or in a Trikona from Lagn.
Diseases of heart, imprisonment, loss of kinsmen, distress to wife and children, destruction of wealth and cattle etc. will result, if Mercury is in his debilitation Rasi, if Mercury is combust, or, if Mercury is in Ari, Randhra, or Vyaya.
There will be journeys to foreign lands, increase in the number of enemies, affliction with many kind of ailments, antagonism with the king, quarrels with kinsmen etc., if Mercury be associated with the Lord of the Dasa.
Fulfillment of all ambitions, gain of wealth and grains, recognition by the king, acquisition of a kingdom, gain of clothes and ornaments, attachment to many kind of musical instruments, attainment of the position of a Commander of an Army, discussions on Shastras and Puranas, gain of riches to wife and children and beneficence of Goddess Lakshmi will be the very auspicious results, if Mercury is in a Kendra, or Trikona from the Lord of the Dasa, or, if Mercury is in his exaltation Rasi.
Effects, like defamation, sinful thinking, harsh speech, danger from thieves, fire and the king, quarrels without reason, fear of attacks by thieves and dacoits (armed robber bands) during travels, will be derived, if Mercury is in the 6th, the 8th, or the 12th from Mars, or is associated with malefics.
There will be a possibility of critical illness in the Antardasa of Mercury, if he is Dhana’s, or Yuvati’s Lord. Remedial measures to obtain relief from these evil effects are recitation of Vishnu Sahasranam and giving a horse in charity."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Mars-Ketu",
				"lord" : "Mars",
				"sublord" : "Ketu",
				"effect" : "Beneficence of the king, gain of wealth, little gains of land at the commencement of the Dasa and substantial later, birth of a son, conferment of authority by government, gain of cattle etc. will be the results in the Antardasa of Ketu in the Dasa of Mars, if Ketu is in a Kendra, in a Trikona, in Sahaj, or Labh, or, if Ketu is associated with, or receives a Drishti from benefics.
Birth of a son, increase in reputation, beneficence of Goddess Lakshmi, gains of wealth from employees, attainment of the position of a Commander of an Army, friendship with the king, performance of oblations, gains of clothes and ornaments etc. will be the beneficial effects, if Ketu is a Yog Karak and is endowed with strength. (Ketu assumes the role of a Yog Karak, if he is yuti with a Yog Karak Grah (Lord of a Kendra and a Trikona)).
Effects, like quarrels, tooth trouble, distress from thieves and tigers, fever, dysentery, leprosy and distress to wife and children etc. will be experienced, if Ketu is in the 6th, the 8th, or the 12th from the Lord of the Dasa. If Ketu is in Dhana, or in Yuvati, there will be diseases, disgrace, agony and loss of wealth."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Mars-Venus",
				"lord" : "Mars",
				"sublord" : "Venus",
				"effect" : "Effects, like acquisition of a kingdom, great enjoyment and comfort of luxuries, gain of elephants, horses, clothes etc., will be derived in the Antardasa of Venus in the Dasa of Mars, if Venus is in a Kendra to Lagn, if Venus is in his exaltation, or in his own Rasi, or, if Venus is Lagn’s, Putr’s, or Dharm’s Lord. If Venus is related to Lagn’s Lord, there will be happiness to wife and children, opulence and glory and increased good fortune.
Gain of property, celebrations on the birth of a son, gain of wealth from the employer, acquisition of a house, land, villages etc. by the beneficence of the sovereign, will be the results, if Venus is in the 5th, the 9th, the 11th, or the 2nd from the Lord of the Dasa. In the last part of the Dasa there will be functions of songs and dances and bathing in holy water. If Venus is connected with, or related to the Lord of Karm, there will be construction of wells, reservoirs etc. and performance of religious, charitable and pious deeds.
There will be sorrows, physical distress, loss of wealth, danger from thieves and the king, dissensions in the family, distress to wife and children and destruction of cattle, if Venus be in the 6th, the 8th, or the 12th from the Lord of the Dasa, or be associated with malefics.
If Venus be the Lord of the 2nd, or the 7th, there will be pains in the body in his Antardasa. For regaining good health the remedial measure to be adopted is giving a cow, or female buffalo in charity."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Mars-Sun",
				"lord" : "Mars",
				"sublord" : "Sun",
				"effect" : "Effects, like acquisition of conveyances, gain of reputation, birth of a son, growth of wealth, amicable atmosphere in the family, sound health, potency, recognition by the the king, extraordinary profits in business and audience with the king etc. will be experienced in the Antardasa of Sun in the Dasa of Mars, if Sun is in his exaltation, in his own Rasi, or, if Sun is in a Kendra, in a Trikona, or in Labh along with Karm’s Lord and with Labh’s Lord.
Distress to the body, agony, failure in ventures, possibilities of suffering from troubles in the forehead, fever, dysentery etc. will be the effects, if Sun is in the 6th, the 8th, or the 12th from the Lord of the Dasa, or, if Sun is associated with malefics.
There will be attacks of fever, danger from snakes and poison and distress to son, if Sun be the Lord of the 2nd, or the 7th. The remedial measure to gain good health and wealth is to perform worship of Sun in the prescribed manner."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Mars-Moon",
				"lord" : "Mars",
				"sublord" : "Moon",
				"effect" : "Acquisition of more kingdom, gain of perfumes, clothes, construction of reservoirs, shelters for cows etc., celebrations of auspicious functions, like marriage etc., happiness to wife and children, good relations with parents, acquisition of property by the beneficence of the sovereign, success in the desired projects will be the effects in the Antardasa of Moon in the Dasa of Mars, if Moon is in her exaltation Rasi, or in her own Rasi, or in a Kendra, or in Dharm, or in Bandhu, or in Karm, or in Lagn along with the Lords of those Bhavas. The good effects will be realized in full, if Moon is waxing. Waning Moon will reduce the impact of the effects to some extent.
The effects, like death, distress to wife and children, loss of lands, wealth and cattle and danger of a war etc. will be experienced, if Moon is in his debilitation Rasi, or, if Moon is in his enemy Rasi, or, if Moon is in Ari, in Randhra, or in Vyaya from Lagn, or from the Lord of the Dasa. There will be the possibility of premature death, distress to the body and mental agony, if Moon is Dhana’s, or Yuvati’s Lord. The remedial measures to be adopted to obtain relief from the above evil effects, are recitation of Mantras of the Goddess Durga and the Goddess Lakshmi."
		}
	]
}
