{
	"configs" : [
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Rahu-Rahu",
				"lord" : "Rahu",
				"sublord" : "Rahu",
				"effect" : "Effects, like acquisition of a kingdom, enthusiasm, cordial relations with the king, happiness from wife and children and increase in property, will be derived in the Antardasa of Rahu in the Dasa of Rahu, if Rahu is in Kark, Vrischik, Kanya, or Dhanu and is in Sahaj, Ari, Karm, or Labh, or is yuti with a Yog Karak Grah in his exaltation Rasi.
There will be danger from thieves, distress from wounds, antagonism with government officials, destruction of kinsmen, distress to wife and children, if Rahu is in Randhra, or Vyaya, or be associated with malefics.
If Rahu is Dhana’s, or Yuvati’s Lord, or is in Dhana, or Yuvati, there will be distress and diseases. To obtain relief from the above evil effects Rahu should be worshipped (by recitation of his Mantras) and by giving in charity things, connected with, or ruled by Rahu."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Rahu-Jupiter",
				"lord" : "Rahu",
				"sublord" : "Jupiter",
				"effect" : "Effects, like gain of position, patience, destruction of foes, enjoyment, cordial relations with the king, regular increase in wealth and property, like the growth of Moon of the bright half of the month (Shukla Paksh), gain of conveyance and cows, audience with the king by performing journey to the West, or South-East, success in the desired ventures, return to one’s homeland, doing good for Brahmins, visit to holy places, gain of a village, devotion to deities and Brahmins, happiness from wife, children and grand children, availability of sweetish preparations daily etc. will be derived in the Antardasa of Jupiter in the Dasa of Rahu, if Jupiter is in his exaltation, in his own Rasi, in his own Navamsa, or in his exalted Navamsa, or, if Jupiter is in a Kendra, or in a Trikona with reference to Lagn.
Loss of wealth, obstacles in work, defamation, distress to wife and children, heart disease, entrustment of governmental authority etc. will result, if Jupiter is in his debilitation Rasi, is combust, is in Ari, Randhra, or Vyaya, is in an enemy Rasi, or is associated with malefics.
There will be gains of land, good food, gains of cattle etc., inclinations towards charitable and religious work etc., if Jupiter is in a Kendra, in a Trikona, the 11th, the 2nd, or the 3rd from the Lord of the Dasa and is endowed with strength.
Loss of wealth and distress to body will result, if Jupiter is in the 6th, the 8th, or the 12th from the Lord of the Dasa, or, if Jupiter is associated with malefics. There will be danger of premature death, if Jupiter is Dhana’s, or Yuvati’s Lord. The person will get relief from the above evil effects and enjoy good health by the beneficence of the Lord Shiva, if he worships his idol, made of gold."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Rahu-Saturn",
				"lord" : "Rahu",
				"sublord" : "Saturn",
				"effect" : "Effects, like pleasure of the king for devotion in his service, auspicious functions, like celebration of marriage etc. at home, construction of a garden, reservoir etc., gain of wealth and cattle from well-to-do persons, belonging to the Sudra class, loss of wealth caused by the king during journey to the West, reduction in income, due to lethargy, return to homeland, will be derived in the Antardasa of Saturn in the Dasa of Rahu, if Saturn is in a Kendra, in a Trikona, in his exaltation, in his own Rasi, in his Multrikon, in Sahaj, or in Labh.
Danger from menials, the king and enemies, distress to wife and children, distress to kinsmen, disputes with the coparceners, disputes in dealings with others, but sudden gain of ornaments, will result, if Saturn is in his debilitation Rasi, in his enemy’s Rasi, or in Randhra, or Vyaya.
There will be heart disease, defamation, quarrels, danger from enemies, foreign journeys, affliction with Gulma, unpalatable food and sorrows etc., if Saturn is in the 6th, the 8th, or the 12th from the Lord of the Dasa. Premature death is likely, if Saturn is Dhana’s, or Yuvati’s Lord. Remedial measure to obtain relief from the above evil effects and to regain good health is giving a black cow, or a she-buffalo in charity."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Rahu-Mercury",
				"lord" : "Rahu",
				"sublord" : "Mercury",
				"effect" : "Auspicious effects, like Raj Yog, well being in the family, profits and gain of wealth in business, comforts of conveyances, marriage and other auspicious functions, increase in the number of cattle, gain of perfumes, comforts of bed, women etc., will be derived in the Antardasa of Mercury in the Dasa of Rahu, if Mercury is in his exaltation Rasi, in a Kendra, or in Putr and, if Mercury is endowed with strength. Good results, like Raj Yog, beneficence of the king and gain of wealth and reputation, will be realized particularly on Wednesday in the month of Mercury.
Sound health, Isht Siddhi, attending discourse on Puranas and ancient history, marriage, offering of oblations, charities, religious inclination and sympathetic attitude towards others will result, if Mercury is in a Kendra, in the 11th, 3rd, 9th, or 10th from the Lord of the Dasa.
There will be opprobrium (Ninda) of deities and Brahmins by the native, loss of fortune, speaking lies, unwise actions, fear from snakes, thieves and the government, quarrels, distress to wife and children etc., if Mercury is in Ari, Randhra, or Vyaya, or, if Mercury receives a Drishti from Saturn.
If Mercury is Dhana’s, or Yuvati’s Lord, there will be fear of premature death. Remedial measure to obtain relief from the above evil effects is recitation of Vishnu Sahasranam."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Rahu-Ketu",
				"lord" : "Rahu",
				"sublord" : "Ketu",
				"effect" : "During the Antardasa of Ketu in the Dasa of Rahu there will be journeys to foreign countries, danger from the king, rheumatic fever etc. and loss of cattle. If Ketu is yuti with Randhra’s Lord, there will be distress to the body and mental tension. Enjoyment, gain of wealth, recognition by the king, acquisition of gold etc. will be the results, if Ketu is associated with, or receives a Drishti from benefics.
There will be Isht Siddhi, if Ketu is related to the Lord of Lagn. If he is associated with the Lord of Lagn, there will definitely be gain of wealth. There will also definitely be increase in the number of cattle, if Ketu is in a Kendra, or in a Trikona.
Effects, like danger from thieves and snakes, distress from wounds, separation from parents, antagonistic relations with kinsmen, mental agony etc. will be derived, if Ketu is without strength in Randhra, or Vyaya. If Ketu is Dhana’s, or Yuvati’s Lord, there will be distress to the body. The remedial measure to obtain relief from the above evil effects is giving a goat in charity."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Rahu-Venus",
				"lord" : "Rahu",
				"sublord" : "Venus",
				"effect" : "Effects, like gains of wealth through Brahmins, increase in the number of cattle, celebrations for the birth of a son, well-being, recognition from government, acquisition of a kingdom, attainment of a high position in government, great enjoyment and comforts etc. will be experienced in the Antardasa of Venus in the Dasa of Rahu, if Venus is with strength in a Kendra, in a Trikona, or in Labh.
Construction of a new house, availability of sweet preparations, happiness from wife and children, association with friends, giving of grains etc. in charity, beneficence of the king, gain of conveyances and clothes, extraordinary profits in business, celebration of Upasayan ceremony of wearing the sacred thread (Janou) etc. will be the auspicious results, if Venus be in his exaltation, in his own Rasi, in is exalted, or in his own Navamsa.
There will be diseases, quarrels, separation from one’s son, or father, distress to kinsmen, disputes with coparceners, danger of death to oneself, or to one’s employer, unhappiness to wife and children, pain in the stomach etc., if Venus is in Ari, Randhra, or Vyaya, in his debilitation, or in an enemy’s Rasi, or, if Venus is associated with Saturn, Mars, or Rahu.
Enjoyments from perfumes, bed, music etc., gain of a desired object, fulfillment of desires will be the results, if Venus is in a Kendra, in a Trikona, in the 11th, or in the 10th from the Lord of the Dasa.
Effects, like danger from the wrath of Brahmins, snakes and the king, possibility of affliction with diseases, like stoppage of urine, diabetes, pollution of blood, anaemia, availability of only coarse food, nervous disorder, imprisonment, loss of wealth, as a result of penalties, or fines, imposed by government, will be derived, if Venus is associated with malefics in the 6th, 8th, or 12th from the Lord of the Dasa. There will be distress to wife and children, danger of premature death to oneself, if Venus is Dhana’s, or Yuvati’s Lord. Remedial measures to obtain relief from the above evil effects are worship of Goddess Durga and Goddess Lakshmi."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Rahu-Sun",
				"lord" : "Rahu",
				"sublord" : "Sun",
				"effect" : "Effects, like cordial relations with the king, increase in wealth and grains, some popularity/respect, some possibility of becoming head of a village etc., will be experienced in the Antardasa of Sun in the Dasa of Rahu, if Sun is in his exaltation, in his own Rasi, in Labh, in a Kendra, or in a Trikona, or in his exalted, or own Navamsa.
There will be good reputation and encouragement and assistance by government, journeys to foreign countries, acquisition of the sovereignty of the country, gains of elephants, horses, clothes, ornaments, fulfillment of ambitions, happiness to children etc., if Sun is associated with, or receives a Drishti from Lagn’s, Dhana’s, or Karm’s Lord.
Fevers, dysentery, other diseases, quarrels, antagonism with the king, travels, danger from foes, thieves, fire etc. will be the results, if Sun is in his debilitation Rasi, or, if Sun is in the 6th, 8th, or 12th from the Lord of the Dasa.
Well-being in every way and recognition from kings in foreign countries will be the results, if Sun is in a Kendra, in a Trikona, in the 3rd, or in the 11th from the Lord of the Dasa.
There will be danger of critical illness, if Sun is Dhana’s, or Yuvati’s Lord. Worship of Sun is the remedial measure, recommended to obtain relief from the above evil effects."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Rahu-Moon",
				"lord" : "Rahu",
				"sublord" : "Moon",
				"effect" : "Effects, like acquisition of a kingdom, respect from the king, gains of wealth, sound health, gains of garments and ornaments, happiness from children, comforts of conveyances, increase in house and landed property etc., will be derived in the Antardasa of Moon in the Dasa of Rahu, if Moon is in his exaltation, in his own Rasi, in a Kendra, Trikona, or in Labh, or, if Moon is in a friendly Rasi, receiving a Drishti from benefics.
Beneficence of the Goddess Lakshmi, all-round success, increase in wealth and grains, good reputation and worship of deities will be the results, if Moon is in the 5th, 9th, in a Kendra, or in the 11th from the Lord of the Dasa.
There will be the creation of disturbances at home and in the agricultural activities by evil spirits, leopards and other wild animals, danger from thieves during journeys and stomach disorders, if Moon is bereft of strength in the 6th, 8th, or 12th from the Lord of the Dasa. There will the possibility of premature death, if Moon is Dhana’s, or Vyaya’s Lord. The remedial measure to obtain relief from the above evil effects is to give in charity a white cow, or a female buffalo."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Rahu-Mars",
				"lord" : "Rahu",
				"sublord" : "Mars",
				"effect" : "Effects, like the recovery of a lost kingdom and recovery of lost wealth, property at home and increase in agricultural production, gain of wealth, blessings by the household deity (Isht Dev), happiness from children, enjoyment of good food etc., will be derived in the Antardasa of Mars in the Dasa of Rahu, if Mars is in Labh, Putr, or Dharm, or, if Mars is in a Kendra, if Mars receives a Drishti from benefics, or, if Mars is in his exaltation, or in his own Rasi.
There will be acquisition of red-coloured garments, journeys, audience with the king, well-being of children and employer, attainment of the position of a Commander of the Army, enthusiasm and gain of wealth through kinsmen, if Mars is in a Kendra, in the 5th, 9th, 3rd, or in the 11th from the Lord of the Dasa.
Distress to wife, children and co-borns, loss of position, antagonistic relations with children, wife and other close relations, danger from thieves, wounds and pain in the body etc. will result, if Mars is in the 6th, 8th, or 12th from the Lord of the Dasa, receiving a Drishti from malefics.
There will be lethargy and danger of death, if Mars is Dhana’s, or Yuvati’s Lord. The remedial measure to obtain relief from the above evil effects is giving a cow, or a bull in charity."
		}
	]
}
