{
	"configs" : [
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Sun-Sun",
				"lord" : "Sun",
				"sublord" : "Sun",
				"effect" : "Good effects, like acquisition of wealth and grains etc., are derived in the Antardasa of Sun in his own Dasa, if Sun is exalted, in his own Bhava, in Labh, in a Kendra, or in a Trikona. Adverse results will be experienced, if Sun is debilitated, or in an inauspicious Bhava, or Rasi. Medium effects will be realized, if Sun is in other houses. If Sun is the Lord of Dhana, or Yuvati, there will be danger of premature death, or death-like sufferings. The remedial measures to be adopted are Mrityunjaya Japa, or the worship of Sun (by recitation of appropriate Mantras, charity etc.)."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Sun-Moon",
				"lord" : "Sun",
				"sublord" : "Moon",
				"effect" : "Functions, like marriage etc., gain of wealth and property, acquisition of a house, of land, cattle and conveyances etc. will be the effects of the Antardasa of Moon in the Dasa of Sun, if Moon is in a Kendra, or in a Trikona. There will be marriage of the native, birth of children, beneficence of and favours from kings and fulfillment of all ambitions, if Moon is in his exaltation Rasi, or in his own Rasi.
Distress to wife and children, failures in ventures, disputes with others, loss of servants, antagonism with the king and destructions of wealth and grains will be the effects, if Moon is waning, or is associated with malefics. Effects, like danger from water, mental agony, imprisonment, danger from diseases, loss of position, journeys to difficult places, disputes with coparceners, bad food, trouble from thieves etc., displeasure of the king, urinary troubles, pains in the body will be experienced, if Moon is in Ari, Randhra, or Vyaya.
Luxuries, comforts, pleasures, dawn of fortune (Bhagyodaya), increase in the enjoyment from wife and children, acquisition of kingdom, performance of marriage and religious functions, gain of garments, land and conveyance and birth of children and grandchildren will be the auspicious effects, if there are benefics in the 1st, the 9th, or a Kendra from the Lord of the Dasa.
Unpalatable food, or course food, exile to outside places etc. will be the effects in the Antardasa, if Moon is in the 6th, the 8th, or the 12th from the Lord of the Dasa, or, if Moon is weak. There will be premature death, if Moon is the Lord of a Marak Bhava. To acquire peace and comfort, the remedial measure is giving in charity of a white cow and a female buffalo (Mahishi)."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Sun-Mars",
				"lord" : "Sun",
				"sublord" : "Mars",
				"effect" : "Auspicious effects, like acquisition of land, gain of wealth and grains, acquisition of a house etc. will be derived in the Antardasa of Mars in the Dasa of Sun, if Mars is in his exaltation Rasi, in his own Rasi, in a Kendra, or in a Trikona. All-round gains, attainment of the position of a Commander of the Army, destruction of enemies, peace of mind, family comforts and increase in the number of co-borns will be the effects, if Mars is yuti with the Lagn’s Lord.
Brutality, mental ailment, imprisonment, loss of kinsmen, disputes with brothers and failure in ventures will result, if Mars is in the 8th, or in the 12th from the Lord of the Dasa, if Mars is associated with malefics, or, if Mars is without dignity and strength.
Destruction of wealth by the displeasure of the king will be the effect, if Mars is in his debilitation Rasi, or be weak. Diseases of the mind and body will result, if Mars is the Lord of Dhana, or Yuvati Bhava. Recovery from ill health, increase in longevity and success in adventures are possible, if remedial measure, like recitation of Vedas, Japa and Vrashotsarg are performed in the prescribed manner."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Sun-Rahu",
				"lord" : "Sun",
				"sublord" : "Rahu",
				"effect" : "In the Antardasa of Rahu in the Dasa of Sun, if Rahu is in a Kendra, or in a Trikona from Lagn, there will be in the first two months loss of wealth, danger from thieves, snakes, infliction of wounds and distress to wife and children. After 2 months inauspicious effects will disappear and enjoyment and comforts, sound health, satisfaction, favours from the king and government etc. will be the favourable effects, if Rahu is yuti with benefics, or, if Rahu is in the Navamsa of a benefic. Recognition from the king, good fortune, name and fame, some distress to wife and children, birth of a son, happiness in the family etc. will be derived, if Rahu is in an Upachaya from Lagn, if Rahu is associated with a Yog Karak, or is placed auspiciously from the Lord of the Dasa.
Imprisonment, loss of position, danger from thieves and snakes, inflection of wounds, happiness to wife and children, destruction of cattle, house and agricultural fields, diseases, consumption (Gulma - enlargement of the skin), dysentery etc. will be the results, if Rahu is weak, or is in the 8th, or in the 12th from the Lord of the Dasa.
Adverse effects, like premature death and danger from snakes will be derived, if Rahu is in Dhana, or Yuvati, or, if Rahu is associated with the Lords of either of these Bhavas. Worship of Goddess Durga, Japa, giving in charity of a black cow, or female buffalo are the remedial measures for alleviation of the above evil effects, or total escape from them."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Sun-Jupiter",
				"lord" : "Sun",
				"sublord" : "Jupiter",
				"effect" : "Marriage of the native, favours by the king, gain of wealth and grains, birth of a son, fulfillment of the ambitions by the beneficence of the sovereign and gain of clothes will be the auspicious effects, derived in the Antardasa of Jupiter in the Dasa of Sun, if Jupiter is in a Kendra, or in a Trikona to Lagn, in his exaltation Rasi, in his own Rasi, or in his own Varg.
Acquisition of a kingdom, comforts of conveyance, like palanquin (motor car in the present times), gain of position etc. will result, if Jupiter is the Lord of Dharm, or Karm. Better fortune, charities, religious inclinations, worship of deities, devotion to preceptor, fulfillment of ambitions will be the auspicious effects, if Jupiter is well placed with reference to the Lord of the Dasa.
Distress to wife and children, pains in the body, displeasure of the king, non-achievement of desired goals, loss of wealth, due to sinful deeds, mental worries etc. will result in his Antardasa, if Jupiter is in the 6th, or in the 8th from the Lord of the Dasa, or is associated with malefics. Giving in charity gold, a tawny-coloured cow (Kapila Gaya), worship of Isht Lord (Isht Dev) are the remedial measures to obtain alleviation of the evil effects and to achieve good health and happiness."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Sun-Saturn",
				"lord" : "Sun",
				"sublord" : "Saturn",
				"effect" : "Destruction of foes, full enjoyment, some gain of grains, auspicious functions, like marriage etc. at home will be the good effects, derived in the Antardasa of Saturn in the Dasa of Sun, if Saturn is in a Kendra, or in a Trikona from Lagn. Well-being, acquisition of more property, recognition by the king, achievement of renown in the country, gain of wealth from many sources will be the effects, if Saturn is in his exaltation, in his own, in a friendly Rasi and, if Saturn is yuti with a friendly Grah.
Rheumatism, pains, fever, dysentery-like disease, imprisonment, loss in ventures, loss of wealth, quarrels, disputes with coparceners, claimants etc. will be the effects in the Antardasa, if Saturn is in the 8th, or the 12th from the Lord of the Dasa, or is associated with malefics.
There will be loss of friends at the commencement, good effects during the middle part and distress at the end of the Dasa. In addition to other evil effects there will be separation from parents and wandering, if Saturn be in his Rasi of debilitation. If Saturn is the Lord of Dhana, or Yuvati, there will be danger of premature death. Giving in charity black cow, buffalo, goat and Mrityunjaya Japa, are the remedial measures for obtaining relief from the evil effects of the Antardasa. These measures help to achieve happiness and gain of wealth and property."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Sun-Mercury",
				"lord" : "Sun",
				"sublord" : "Mercury",
				"effect" : "Acquisition of a kingdom, enthusiasm and vivacity, happiness from wife and children, acquisition of conveyance through the beneficence of the sovereign, gain of clothes, ornaments, pilgrimage to holy places, acquisition of a cow etc. will be the good effects in the Antardasa of Mercury in the Dasa of Sun, if Mercury is in a Kendra, or in a Trikona from Lagn.
Mercury becomes very beneficial, if he gets associated with the Lord of Dharm. Reverence from and popularity amongst people, performance of pious deeds and religious rites, devotion to the preceptor and deities, increase in wealth and grains and birth of a son, will be the auspicious effects, if Mercury is in Dharm, Putr, or Karm.
Marriage, offering of oblations, charity, performance of religious rites, name and fame, becoming famous by assuming another name, good food, becoming happy, like Indra, by acquiring wealth, robes and ornaments will be the effects, if Mercury is in an auspicious Bhava, like a Trikona etc. from the Lord of the Dasa.
Body distress, disturbance of peace of mind, distress to wife and children, will be the evil effects in the Antardasa of Mercury, if he is in the 6th, the 8th, or the 12th from the Lord of the Dasa (Mercury cannot be in the 6th, or the 8th from Sun). There will be evil effects at the commencement of the Antardasa, some good effects in the middle part of the Antardasa and the possibility of displeasure of the king and exile to a foreign country at the end of the Dasa. If Mercury is the Lord of Dhana, or Yuvati, there will be pains in the body and attacks of fever. For relief from the evil effects and to regain good health and happiness the remedial measures are the recitation of Vishnu Sahasranam and giving in charity grains and an idol, made of silver."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Sun-Ketu",
				"lord" : "Sun",
				"sublord" : "Ketu",
				"effect" : "Body pains, mental agony, loss of wealth, danger from the king, quarrels with the kinsmen will be the effects of the Antardasa of Ketu in the Dasa of Sun. If Ketu is associated with the Lord of Lagn, there will be some happiness at the commencement, distress in the middle part and receipt of the news of death at the end of the Antardasa.
Diseases of teethe, or cheeks, urinary troubles, loss of position, loss of friends and wealth, death of father, foreign journey and troubles from enemies will be the results, if Ketu is in the 8th, or the 12th from the Lord of the Dasa.
Beneficial effects, like happiness from wife and children, satisfaction, increase of friends, gain of clothes etc. and renown will be derived, if Ketu is in Sahaj, Ari, Karm, or Labh.
If Ketu is Lord of Dhana, or Yuvati (or is in any of those Bhavas), there will be danger of premature death. The remedial measures for obtaining relief from the evil effects are recitation of Mantras of Goddess Durga (Shat Chandi Path) and giving a goat in charity."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Sun-Venus",
				"lord" : "Sun",
				"sublord" : "Venus",
				"effect" : "Marriage and happiness, as desired from wife, gain of property, travels to other places, meeting with Brahmins and the king, acquisition of kingdom, riches, magnanimity and majesty, auspicious functions at the home, availability of sweet preparations, acquisition of pearls and other jewels, clothes, cattle, wealth, grains and conveyances, enthusiasm, good reputation etc. are the auspicious effects of the Antardasa of Venus in the Dasa of Sun, if Venus is placed in a Kendra, or in a Trikona, or, if Venus is in his exaltation Rasi, in his own Rasi, in his own Varg, or in a friendly Rasi.
Displeasure of the king, mental agony and distress to wife and children will be the effects in the Antardasa of Venus, if he is in the 6th, the 8th, or the 12th from the Lord of the Dasa. The effects of the Antardasa would be moderate at its commencement, good during the middle portion and evil effects, like disrepute, loss of position, inimical relations with kinsmen and loss of comforts, will be derived at the end. If Venus is the Lord of Yuvati (and Dhana), there will be pains in the body and the possibility of suffering from diseases. There will be premature death, if Venus is associated with Ari’s, or Randhra’s Lord. The remedial measures for obtaining relief from the evil effects are Mrityunjaya Japa, Rudra Japa and giving in charity a tawny cow, or female buffalo."
		}
	]
}
