{
	"configs" : [
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Moon-Moon",
				"lord" : "Moon",
				"sublord" : "Moon",
				"effect" : "Acquisition of horses, elephants and clothes, devotion to deities and preceptor, recitation of religious songs in praise of God, acquisition of a kingdom, extreme happiness and enjoyment and name and fame will be the beneficial results in the Antardasa of Moon in her own Dasa, if she is placed in her exaltation Rasi, her own Rasi, in a Kendra, or in a Trikona, or is associated with the Lord of Dharm, or Karm.
Loss of wealth, loss of position, lethargy, agony, antagonism towards the king and ministers, distress to mother, imprisonment and loss of kinsmen will be the evil effects in her Antardasa, if Moon is in her debilitation Rasi, if Moon is associated with malefics, or, if Moon is in Ari, Randhra, or Vyaya. If Moon is the Lord of Dhana, or Yuvati, or is associated with Randhra’s, or with Vyaya’s Lord, there will be pains in the body and danger of premature death. The remedial measures are giving in charity of a tawny-coloured cow, or female buffalo."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Moon-Mars",
				"lord" : "Moon",
				"sublord" : "Mars",
				"effect" : "Advancement of fortune, recognition by the government, gain of clothes and ornaments, success in all efforts, increase in agricultural production and prosperity at home and profits in business will be the favourable effects of the Antardasa of Mars in the Dasa of Moon, if Mars is in a Kendra, or in a Trikona. Great happiness and enjoyment of comforts will be derived, if Mars is in his exaltation Rasi, or in his own Rasi.
Distress to the body, losses at home and in agricultural production, losses in business dealings, antagonism, or adverse relations with servants (employees) and the king, separation from kinsmen and hot temperament will be the evil effects in the Antardasa of Mars, if he is placed in Ari, Randhra, or Vyaya from Lagn, be associated with, or receives a Drishti from malefics in the 6th, the 8th, or the 12th from the Lord of the Dasa."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Moon-Rahu",
				"lord" : "Moon",
				"sublord" : "Rahu",
				"effect" : "There will be some auspicious results at the commencement of the Antardasa of Rahu in the Dasa of Moon, but later there will be danger from the king, thieves and snakes, distress to cattle, loss of kinsmen and friends, loss of reputation and mental agony, if Rahu is placed in a Kendra, or in a Trikona.
Success in all ventures, gain of conveyances, garments etc. from the king etc. in the South-West direction will be derived, if Rahu in his Antardasa receives a Drishti from benefics, if Rahu is in Sahaj, Ari, Karm, or Labh, or, if Rahu is yuti with a Yog Karak Grah.
Loss of position, mental agony, distress to wife and children, danger of diseases, danger from the king, scorpions and snakes etc. will happen, if Rahu is weak and is placed in the 8th, or the 12th from the Lord of the Dasa.
Pilgrimage to holy places, visits to sacred shrines, beneficence, inclination towards charitable deeds etc. will be the results, if Rahu is in a Kendra, in a Trikona, or in the 3rd, or the 11th from the Lord of the Dasa. There will be body troubles (physical afflictions), if Rahu is in Dhana, or in Yuvati. Rahu Japa and giving a goat in charity are the remedial measures for obtaining relief from the evil effects in the Antardasa of Rahu."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Moon-Jupiter",
				"lord" : "Moon",
				"sublord" : "Jupiter",
				"effect" : "Acquisition of a kingdom, auspicious celebrations at home, gains of clothes and ornaments, recognition from the king beneficence of the Isht Lord (Isht Devata), gains of wealth, land, conveyances, success in all ventures by the beneficence of the king will be the beneficial effects in the Antardasa of Jupiter in the Dasa of Moon, if Jupiter is placed in a Kendra, or in a Trikona to Lagn, or, if Jupiter is in his own, or in his exaltation Rasi.
Destruction of preceptor (and father etc.) and children, loss of position, mental agony, quarrels, destruction of a house, conveyances and agricultural land will be the evil effects in his Antardasa, if Jupiter is in Ari, Randhra, or Vyaya, if Jupiter is combust, in his debilitation Rasi, or be associated with malefics. Gains of cattle, grains, clothes and happiness from brothers, acquisition of property, valour, patience, oblations, celebrations, like marriage etc., gain of a kingdom etc. will be the favourable effects, if Jupiter is in 3rd, or in the 11th from the Lord of the Dasa.
Effects, like unpalatable food, journeys to places away from the homeland, will be derived, if Jupiter is weak and is placed in the 6th, the 8th, or the 12th from Moon. There will be good effects at the commencement of the Antardasa and distress at its end. There will be premature death, if Jupiter is Dhana’s, or Yuvati’s Lord. Remedial measures for obtaining relief from the above evil effects are recitation of Shiva Sahasranam Japa and giving gold in charity."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Moon-Saturn",
				"lord" : "Moon",
				"sublord" : "Saturn",
				"effect" : "Effects, like birth of a son, friendship, gain of wealth and property, profits in business with the help of Sudras, increase in agricultural production, gains from son, riches and glory by the beneficence of the king, will be experienced in the Antardasa of Saturn in the Dasa of Moon, if Saturn is in a Kendra, or in a Trikona from Lagn, or, if Saturn is in his own Rasi, in his own Navamsa, in his exaltation Rasi, if Saturn receives a Drishti from, or is associated with benefics, or, if Saturn is in Labh with strength.
Effects, like visits to holy places, bathing in holy rivers etc., the creation of troubles by many people and distress from enemies, will be derived in the Antardasa of Saturn, if Saturn is in Ari, Randhra, Vyaya, or Dhana, or, if Saturn is in his debilitation Rasi.
Effects, like enjoyments and gains of wealth some times, while opposition, or quarrels with wife and children at other times, will be realized, if Saturn is in a Kendra, or in a Trikona from the Lord of that Dasa, or is endowed with strength. If Saturn is in Dhana, Yuvati, or Randhra, there will be physical distress. The remedial measures to be adopted for obtaining relief from the evil effects are Mrityunjaya Japa, giving in charity a black cow, or female buffalo."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Moon-Mercury",
				"lord" : "Moon",
				"sublord" : "Mercury",
				"effect" : "Effects, like acquisition of wealth, recognition by the king, gain of clothes etc., discussions on Shastras gain of knowledge from society with learned and holy people, enjoyments, birth of children, satisfaction, profits in business, acquisition of conveyance and ornaments etc. will be experienced in the Antardasa of Mercury in the Dasa of Moon, if Mercury is in a Kendra, or in a Trikona, if Mercury is in his own Rasi, in his own Navamsa, or in his exaltation Rasi, endowed with strength.
Effects, like marriage, oblations (Yagya), charities, performance of religious rites, close relations with the king, social contacts with men of learning, acquisition of pearls, corals, Mani (jewels), conveyances, clothes, ornaments, good health, affections, enjoyments, drinking of Soma Rasa and other tasty syrups etc. will be derived in the Antardasa of Mercury, if he is in a Kendra, or in a Trikona, or in the 11th, or in the 2nd from the Lord of the Dasa.
Pains in the body, loss in agricultural ventures, imprisonment, distress to wife and children will be the inauspicious effects, if Mercury be in the 6th, the 8th, or the 12th from the Lord of the Dasa, or be in his debilitation Rasi. If Mercury is the Lord of Dhana, or Yuvati, there will be fear of fever. The remedial measures to be adopted for obtaining relief from the evil effects are recitation of Vishnu Sahasranam and giving a goat in charity."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Moon-Ketu",
				"lord" : "Moon",
				"sublord" : "Ketu",
				"effect" : "Effects, like gain of wealth, enjoyment, happiness to wife and children, religious inclination etc., will arise in the Antardasa of Ketu in the Dasa of Moon, if Ketu is in a Kendra, in a Trikona, or Sahaj and is endowed with strength. There will be some loss of wealth at the commencement of the Antardasa. Later all will be well.
Gain of wealth, cattle etc. will be the effects, if Ketu is in a Kendra, in the 9th, the 5th, or the 11th from the Lord of the Dasa and is equipped with strength. There will be loss of wealth at the end of the Antardasa.
There will be obstacles in ventures, due to interference by enemies and quarrels, if Ketu be in the 8th, or the 12th from the Lord of the Dasa, or receives a Drishti from, or is associated with malefics. If Ketu is in Dhana, or in Yuvati, there will be danger of affliction of the body with diseases. Mrityunjaya Japa will give relief in all the evil effects and will ensure gain of wealth and property with the beneficence of Lord Shiva."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Moon-Venus",
				"lord" : "Moon",
				"sublord" : "Venus",
				"effect" : "Effects, like acquisition of a kingdom, gaining of clothes, ornaments, cattle, conveyances etc., happiness to wife and children, construction of a new house, availability of sweet preparations every day, use of perfumes, affairs with beautiful women, sound health etc. will be experienced in the Antardasa of Venus in the Dasa of Moon, if Venus is in a Kendra, in a Trikona, in Labh, Bandhu, or Dharm, or in his exaltation Rasi, or in his own Rasi.
Physical soundness, good reputation, acquisition of more land and houses, will result, if Venus is yuti with the Lord of the Dasa.
There will be loss of landed property, children, wife and cattle and opposition from government, if Venus is in his debilitation Rasi, combust, or receives a Drishti from, or is associated with malefics.
If Venus is in Dhana in his exaltation Rasi, or in his own Rasi, or is there, associated with the Lord of Labh, there will be acquisition of an underground hidden treasure, gain of land, enjoyment, birth of a son etc. Advancement of good fortune, fulfillment of ambitions with the beneficence of the king, devotion to deities and Brahmins, gain of jewels, like pearls etc. will result, if Venus is yuti with Dharm’s, or Labh’s Lord.
Acquisition of more house property and agricultural land and gain of wealth and enjoyment will be the good effects, if Venus is in a Kendra, or in a Trikona from the Lord of the Dasa.
Deportation to foreign lands, sorrows, death and danger from thieves and snakes will be the results, if Venus is in the 6th, the 8th, or the 12th from the Lord of the Dasa.
There will be danger of premature death, if Venus be the Lord of the 2nd, or 7th. The remedial measures to be adopted for obtaining relief from the evil effects are Rudra Japa and giving in charity a white cow and silver."
		},
		{
				"source" : "Hora Shastra",
				"dasa" : "Vimsottari",
				"description" : "Moon-Sun",
				"lord" : "Moon",
				"sublord" : "Sun",
				"effect" : "Recovery of a lost kingdom and wealth, happiness in the family, acquisition of villages and land with the kind assistance of one’s friends and the king, birth of a son, beneficence of Goddess Lakshmi, will be the beneficial results in the Antardasa of Sun in the Dasa of Moon, if Sun is in his exaltation Rasi, in his own Rasi, in a Kendra, or in Putr, or in Dharm, or in Labh, or in Dhana, or in Sahaj. At the end of the Antardasa there is the likelihood of attacks of fever and lethargy.
Danger from the government, thieves and snakes, affliction with fever and troubles in foreign journey are the likely results, if Sun is in the 8th, or 12th from the Lord of the Dasa. If Sun is the Lord of Dhana, or Yuvati, there will be sufferings from fever in his Antardasa. Worship of Lord Shiva is the remedial measure to obtain relief from the above evil effects."
		}
	]
}
