{
	"configs" : [
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Ketu",
				"effect" : "Sloka 145. At the time of Ketu's influence begins to ripen and yield fruit, a person feels distressed; his sense and judgment fail; he becomes afflicted with various diseases; his physical torments grow; his evil acts multiply; his life is one of great misery. His comforts, if any, are but slight.
Sloka 155. Ketu associated with a benefic planet yields happiness in its dasa. If aspected by a benefic planet, it leads to the acquisition of abundant wealth.
Sloka 156. When associated with malefic planets, Ketu produces danger throuqh the instrumentality of wicked men and misery through acquired diseases leading to waste of wealth.
Sloka 157. Three-fold is the effect of Ketu's dasa. At the beginning of it, elders and relations are taken ill; in the middle of it, there is money coming in; at the end there is happiness."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mercury",
				"effect" : "Sloka 133. During the period that Mercury's influence takes effect, a person will earn money through the instrumentality of reverend seniors, relatives and friends; he will have fame and happiness; he will go on an embassy, derive an income by dealing in gold ware and suffer from wind ailment.
Sloka 143. Mercury occupying the depression Navamsa in its exaltation sign, produces incompetency for work in the person concerned and makes him indigent in its dasa.
Sloka 144. Mercury in depression but in the exaltation Navamsa ordains prosperity in the end of its dasa though in the beginning thereof all be barren of effect."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Jupiter",
				"effect" : "Sloka 110. Jupiter secures to the person concerned, during its dasa, rank, wealth, vehicle, apparel, royal good will, purity of heart, power, knowledge, practice corresponding thereto, wife, children and all else connected therewith.
Sloka 120. Jupiter occupying a depression Navamsa in its exaltation sign brings on during the progress of its dasa danger through robbers, foes and rulers, the hatred of wife and sons and bad luck generally; but when the planet is in the exaltation Navamsa in its depression sign, it secures during its dasa to the person concerned, royal favor, material comforts, learning, wisdom, fame, wealth and the influence which such things carry; and it may even be the lordship of the whole country."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Saturn",
				"effect" : "Sloka 121. Astrologers declare that during dasa of Saturn, a person may come into possession of goats, asses, camels, old women, birds and coarse grain and get wealth by the administration of a guild,  township or village community and become the ruler of a low tribe.
Sloka 132. Saturn occupying the depression Navamsa in its exaltation house produces happiness at the commencement of its dasa, but towards the end, it is fraught with woe to the creatures concerned. If the planet occupy the exaltation Navamsa in its depression house, the end of the dasa is happy while in the initial portion there may be evil to be feared from robbers and enemies, much misery and roaming in foreign lands."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mars",
				"effect" : "Sloka 84. Astrologers opine that in the ripening of Mars' mahadasa there may be attempts at money-making by taking to fire arms and by engaging in wars among rival kings and by other ways; there may be coming in of money also by medicine, by trickery, by fraud, and by diverse cruel acts; there may be suffering caused by fever arising from a morbid state of bile and blood; there will be seen a propensity on the part of the person concerned to resort continually to the society of low women and a crop of hatred emanating from sons, wife, relatives and reverend seniors. And in consequence of all this, the person will have to eat bad unwholesome food.
Sloka 94. At the out$et of Mars dasa, there will be humiliation and waste of wealth. In the middle of the dasa, there may be danger to be apprehended from rulers, fire, brigands, and the like; the same will happen also in the concluding portion of the dasa.
Sloka 95. If Mars occupy the depression Navamsa in its exaltation house, there will be according to the astrologers, death among the children and brothers of the person concerned, during the dasa of the planet. If it be in the house of depression and occupy the exaltation Navamsa, the effect will appear in the success of agriculture and other operations and in the accession to lands, wealth, grain and material comforts."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Moon",
				"effect" : "Sloka 73. During the progress of the Moon's mahadasa, a person will have access to sacred prayers, scripture and Brahmanas; he will exert fascination over young females, and secure to himself women, wealth and lands; he will have a profusion of flowers, cloths, ornaments, perfumes and various valuable objects of enjoyment; but if there be anything to check the Moon's strength, the effect on the person concerned will be that he will be poor and suffer from wind-disease.+
Sloka 83. The effect due to the bhava over which the Moon presides may come off in the commencement of its mahadasa; that due to the character of the sign representing the bhava as well as to the Moon's position will be seen in the middle; what is due to the aspect on the Moon of other planets and what affects the part of the body denoted by the bhava will appear towards the end of the mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Sun",
				"effect" : "Sloka 60. During the progress of the Sun's dasa, the general effects to be noted will be: money-making by stealthy mining and other ways, trouble from fire and beasts, inflammation of the eyes, illness affecting the stomach and teeth, separation from wife and children, loss among reverend seniors and parents and general decay among servants, kine and property.
Sloka 71. In the initial portion of the Sun's dasa, the father of the person concerned will fall ill, and there will be much expense. In the middle, there will be trouble to every one whether biped or quadruped in the household. In the end, there may be ease and comfort.
Sloka 72. During the progress of the Sun's mahadasa occupying the depression Navamsa in its exaltation house, a person has to apprehend ill-fame, danger, the death of a son, a wife or some paternal relation and loss of property in connection with agriculture and other pursuits. But in the dasa of the same planet occupying the exaltation Navamsa in the depression house, the person concerned will attain regal prosperity, happiness, though towards the end thereof there may occur loss of wealth or his own demise."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Venus",
				"effect" : "Sloka 158. Venus in its dasa leads to the aquisition of wife, children, wealth, exceeding comfort, fragrant wreaths, apparel, ornaments, vehicles and other means of locomotion, fortune and fame equal to a king's.
Sloka 168. Venus in its exaltation sign but in the depression Navamsa causes loss of wealth and loss of status in its dasa.
Sloka 169. Venus in its depression sign but in the exaltation Navamsa gives to the person concerned during the ripening of its dasa, (success in) agriculture and trade and accession to his wealth."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Rahu",
				"effect" : "Sloka 96. Loss of such things as comfort, happiness, wealrh and worldly status, the pang of parting with a wife, children and relatives, illness in the extreme, residence in a strange land, and a disposition to wrangle are what Rahu brings about.
Sloka 106. Rahu occupying Cancer, Taurus or Aries, say the astrologers, will secure to the person concerned during the ripening of its dasa wealth and corn, edification and amusement, honor from the sovereign, wives, servants and dependants happy and well-off.
Sloka 107. Astrologers say that Rahu in Kanya, Meena, or Dhanus gives to the person concerned during its dasa wife and children, lordship of lands and a carriage drawn by men. All these are liable to be lost at the conclusion of the dasa.
Sloka 108. When Rahu is in Leo, Virgo or Cancer, a person becomes a king or a king's peer during the ripening of its dasa; he wilt command an army composed of elephants and horses, will be highly beneficent, exceedingly wealthy, devoted to pleasure and dearly attached to his wife and children.
Sloka 109. At the outset of Rahu dasa, a person suffers distress; in the middle of it, he may have much enjoyment; but in the end, he may become bereaved of his parents and even lose his status."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mars",
				"sublord" : "Rahu",
				"effect" : "Sloka 86. During Rahu's bhukti in Mars' dasa there is peril to be apprehended from rulers, robbers and the like; destruction of wealth and corn and success in evil pursuits."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Saturn",
				"sublord" : "Saturn",
				"effect" : "Sloka 122. In its own dasa and bhukti, Saturn may bring on disease and suffering through the trouble and torment which the person under its influence is made to undergo; by exciting his envy and pride, it leads to much sorrow and mental anguish; by exposing him to the rapacity of kings and freebooters, it deprives him of his wealth and store of grain.
Sloka 123. In Saturn's dasa and bhukti, a person has to encounter opposition, incur the displeasure of the king's men, keep old servant-women, and be in dread of his cattle being poisoned; his wife and children have much suffering; himself being liable to fever, wind or phlegm ailments and to colic."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Saturn",
				"sublord" : "Moon",
				"effect" : "Sloka 128. Death of a revered matronly female, sorrow, dislike of relatives, coming in of money and wind disease may be experienced during the Moon's bhukti in the dasa of Saturn."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Saturn",
				"sublord" : "Sun",
				"effect" : "Sloka 127. Loss of wife and children, trouble from the king or robbers, and a sinking of the heart, a person hag to experience, during the Sun's bhukti in Saturn's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mars",
				"sublord" : "Mercury",
				"effect" : "Sloka 89. Accession of wealth from the trading community, abundance of houses, cows and grain, trouble from enemies and mental worry - these, a person may have in the interval of Mercury in Mars' mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Venus",
				"sublord" : "Mercury",
				"effect" : "Sloka 166. During Mercury's interval in the dasa of Venus a person secures the comfort of his sons, friends, wealth, royal favor, happiness on a large scale, prosperity and sound health."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Jupiter",
				"sublord" : "Rahu",
				"effect" : "Sloka 119. Apprehension of every trouble, disease, occasion for every possible calamity, and deprivation of income - this falls to the lot of a person in Rahu's bhukti in Jupiter's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Venus",
				"sublord" : "Ketu",
				"effect" : "Sloka 167. Discord, death of relatives, injury inflicted by enemies, misgiving in the heart and deprivation of wealth are what a person should be prepared for in Ketu's bhukti in the mahadasa of Venus."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Sun",
				"sublord" : "Mars",
				"effect" : "Sloka 64. When Mars has its apahara in the Sun's dasa, an astrologer may foretell to the person concerned acquisition of wealth in the form of gems and gold, royal favor leading to prosperity, contraction and transmission of bilious and allied diseases."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Sun",
				"sublord" : "Mercury",
				"effect" : "Sloka 68. Trouble from relatives, mental distress, depression of spirits, waste of money and slight comfort are what may be expected in the apahara of Mercury during the progress of the Sun's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Moon",
				"sublord" : "Mars",
				"effect" : "Sloka 75. Disease, petulance, loss of place, waste of wealth, trouble from friends and brothers may be expected to crop up in the bhukti of Mars in the Moon's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mercury",
				"sublord" : "Moon",
				"effect" : "Sloka 138. Diseases, ill-will of enemies, miscarriage of every concern, risk from quadrupeds await a person during the Moon's interval in Budha dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Sun",
				"sublord" : "Jupiter",
				"effect" : "Sloka 66. What is all-worthy-wealth got through a worthy son, honor to Gods and Brahmanas, virtuous acts, good traditional observances, good society and good conversation will distinguish the the antardasa of Jupiter during the Sun's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Ketu",
				"sublord" : "Ketu",
				"effect" : "Sloka 146. When Ketu has its interval in its own dasa, a person has to apprehend the death of his wife and children, loss of happiness and wealth and evil from his enemies."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Rahu",
				"sublord" : "Sun",
				"effect" : "Sloka 103. Love of charitable acts, contentment, cessation of all violence and outrage and the spread of a contagious disease will mark the Sun's bhukti in Rahu dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mercury",
				"sublord" : "Mercury",
				"effect" : "Sloka 134. Acquisition of beautiful houses and apparel, money through Brahmanas and relatives and success in every undertaking may be looked for in Mercury's bhukti in its own mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Sun",
				"sublord" : "Sun",
				"effect" : "Sloka 62. During the dasa and bhukti of the Surya, a person may acquire wealth through Brahming Kshatriyar, or by a resort to arms or other ways; he may at the same time have much mental suffering and lead a wandering life through a foreign wild country."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Venus",
				"sublord" : "Venus",
				"effect" : "Sloka 159. Acquisition of conches, females, wealth and apparel, good work and other such means of securing perfect happiness, disappearance of enemies and attainment of fame will mark Sukra's bhukti in its mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Jupiter",
				"sublord" : "Jupiter",
				"effect" : "Sloka 111. Royal favor, great diligence, achievement of everything attempted, learning and science are what a person may expect in Jupiter's dasa and bhukti."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mercury",
				"sublord" : "Jupiter",
				"effect" : "Sloka 141. When Jupiter has its bhukti in Budha dasa, a person will incur the hatred of friends, relatives and elders; will have additions to wealth and children, end will be liable to risk from diseases and the like."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Saturn",
				"sublord" : "Venus",
				"effect" : "Sloka 126. A person experiences the good will of relatives, the approbation of the people, accession of wives, property and wealth, and the joys arising from agriculture and kindred pursuits pending Sukra's interval in Sani dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Ketu",
				"sublord" : "Mercury",
				"effect" : "Sloka 154. The society of relatives, friends and the like, accession of wealth to sons and wife, and happiness derivable from knowledge accrue in Mercury's bhukti in Ketu dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mars",
				"sublord" : "Sun",
				"effect" : "Sloka 92. Blame, odium of the elders, quarrel with them, suffering caused by disease, heart-ache occasioned by one's own party are what may crop up in the Sun's apahara in Mars' dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Venus",
				"sublord" : "Rahu",
				"effect" : "Sloka 163. Acquisition of black substances forming a valuable property, dislike of relatives, evil from friends, and injury by fire may be expected in Rahu's bhukti in the mahadasa of Venus."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Ketu",
				"sublord" : "Saturn",
				"effect" : "Sloka 153. Misgiving in the heart, mental anguish difference with kith and kin and the abandonment of native country will mark Saturn's interval in Ketu dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Moon",
				"sublord" : "Moon",
				"effect" : "Sloka 74. Devoted attention to learning, love and music - vocal as well as instrumental - suits of silk and other articles of attire which success in these pursuits generally secures, refined society - sound health - good renown such as even royal ministers and army leaders esteem and envy - journey to sacred streams and places in company with family and friends - and lastly what is dear to the heart, the acquisition of lands, cows and horses - abundant wealth and power - these are what the Moon will give in the ripening of its own dasa and bhukti."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Ketu",
				"sublord" : "Rahu",
				"effect" : "Sloka 151. Fear of kings and robbers, sorrow, ruin of every business and altercation with bad people are to te expected in Rahu's bhukti in Ketu dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mars",
				"sublord" : "Moon",
				"effect" : "Sloka 93. Various comforts that wealth affords, cloths, pearls, precious stones, ornaments, heavy sleep and ardent passion may mark the Moon's bhukti in Mars' mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mercury",
				"sublord" : "Sun",
				"effect" : "Sloka 137. Acquisition of apparel, ornaments and wealth, royal favor, great ease, and hearing of moral homilies may be expected in the Sun's bhukti in Budha dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Jupiter",
				"sublord" : "Venus",
				"effect" : "Sloka 115. Acquisition of vehicles and other valuable property, the glory of umbrellas and chowries, trouble from females and public odium are to be looked for in Sukra's interval in Jupiter's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Rahu",
				"sublord" : "Ketu",
				"effect" : "Sloka 101. Brigandage, loss of wealth and honor, loss of children, death among cattle, misfortunes of all kinds await a person in Ketu's bhukti in Rahu dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Rahu",
				"sublord" : "Rahu",
				"effect" : "Sloka 97. Illness of a wife, a controversy, failure of the intellect, waste of wealth, roaming in a far-off land and distress will be the characteristic features of Rahu's bhukti in Rahu's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Saturn",
				"sublord" : "Rahu",
				"effect" : "Sloka 130. The anguish of disease in every limb, the devastation wrought by robbers, foes and rapacious rulers, and the deprivation of wealth are what a person may have to suffer during Rahu's bhukti in the dasa of Saturn."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Jupiter",
				"sublord" : "Ketu",
				"effect" : "Sloka 114. Acquisition of pearl and coral ornaments, pilgrimages to holy shrines, increase of wealth and suffering for the sake of reverend seniors and the king will mark Ketu's interval in Jupiter's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Moon",
				"sublord" : "Venus",
				"effect" : "Sloka 81. During the period of time allotted to Venus in the Moon's dasa, a person may get a dowry on behalf of his wife and enjoy the comforts derivable from agriculture, cattle and the like, water-products and clothing; he may become liable to any disease constitutionally inherited from his mother."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Jupiter",
				"sublord" : "Mercury",
				"effect" : "Sloka 113. Acquisition of wealth by means of the trading community, royal favor leading to material comforts and perfect practice of hospitality will mark Mercury's bhukti in Jupiter's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Saturn",
				"sublord" : "Mars",
				"effect" : "Sloka 129. Loss of place, serious illness, various apprehensions, distress of brothers and friends have to be looked for in Kuja's interval in Saturn's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Sun",
				"sublord" : "Venus",
				"effect" : "Sloka 70. Acquisition of pearls or other products of the sea, fatigue, addiction to bad females and profitless discussion will mark Sukra's bhukti in the Sun's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mercury",
				"sublord" : "Saturn",
				"effect" : "Sloka 142. Acts of charity and beneficence, acquisition of wealth, material comforts secured through the instrumentality of petty chiefs, loss in agriculture and the like will mark Saturn's bhukti in Budha dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Rahu",
				"sublord" : "Mars",
				"effect" : "Sloka 105. A combination of all possible calamities, bewilderment in every work and a culpable failure of memory will be the characteristic features of Mars' interval in Rahu dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Ketu",
				"sublord" : "Moon",
				"effect" : "Sloka 149. Ennui affecting wife, children and attendants, destruction of wealth and corn, and distress of mind are to be looked for in the Moon's bhukti in Ketu dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Rahu",
				"sublord" : "Saturn",
				"effect" : "Sloka 99. A disease due to wind and bile, the distress of relatives, friends and well wishers, and residence in a remote foreign land are what may crop up during Saturn's interval in Rahu's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Venus",
				"sublord" : "Moon",
				"effect" : "Sloka 161. When the Moon has its interval in the dasa of Venus, a person suffers much pain from a disease due to an inflammation in the nervous tissues and from lust and other evil passions of human nature and what' ever ease he can feel under the circumstances must be small or slight."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Saturn",
				"sublord" : "Jupiter",
				"effect" : "Sloka 131. Devotion to Gods and Brahmanas, royal favor, great happiness and attainment of rank, a person will have, during Jupiter's bhukti in Saturn's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mars",
				"sublord" : "Venus",
				"effect" : "Sloka 91. Jewel for the wife, clothing, incoming of money, from relatives, odium of females and their society (nevertheless) will be what a person may expect in the bhukti of Venus in Mars' dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Rahu",
				"sublord" : "Moon",
				"effect" : "Sloka 104. When the Moon has its bhukti in Rahu dasa, there will be an abundance of enjoyments, good crops, coming in of money and communion with kith and kin."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mercury",
				"sublord" : "Mars",
				"effect" : "Sloka 139. Disappearance of all danger from diseases or enemies, fame derived from acts of charity and beneficence, and royal favor accrue to a person during Kuja's bhukti in Budha dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Jupiter",
				"sublord" : "Mars",
				"effect" : "Sloka 118. Failure in business, wandering, high fever, great risk, loss of wealth and depression of spirits, a person must be prepared for in Kuja's interval in Jupiter's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Moon",
				"sublord" : "Ketu",
				"effect" : "Sloka 80. Illness of a wife, loss of relatives, suffering from diseases of the stomach and loss of property crop up in Ketu's interval in the Moon's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Moon",
				"sublord" : "Mercury",
				"effect" : "Sloka 79. Accession of wealth from relations on the mother's side, learned men seeking asylum and acquisition of clothing and ornaments will mark the bhukti of Mercury in the Moon's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mars",
				"sublord" : "Mars",
				"effect" : "Sloka 85. Great heat, dislike of friends, annoyance from brothers, danger to be dreaded from a ruler and ruin of all undertakings will be the characteristic features of Mars' own interval in the planet's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Rahu",
				"sublord" : "Jupiter",
				"effect" : "Sloka 98. Total disappearance of ailments and enemies, royal favor, accession of wealth, acquisition of children and great perseverance will mark Jupiter's bhukti in Rahu's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Venus",
				"sublord" : "Jupiter",
				"effect" : "Sloka 164. During the bhukti of Jupiter in Sukras's mahadasa, a person gets wealth apparel and ornaments, performs his religious duties leading him to ultimate happiness; his wife and children may fall ill and there may be distress in consequence."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mars",
				"sublord" : "Ketu",
				"effect" : "Sloka 90. Great suffering brought on by a disease of the stomach, trouble from relations and brothers, and opposition of bad people have to be apprehended when Ketu has its interval in Mars' dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Sun",
				"sublord" : "Ketu",
				"effect" : "Sloka 69. Throat-disease, mental anguish, ophthalmia or premature death may be expected in Ketu's bhukti in the Sun's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Sun",
				"sublord" : "Saturn",
				"effect" : "Sloka 67. During the bhukti of Saturn tn the Sun's dasa, a person should be prepared for hostility from every one, want of energy, an ignoble calling, mental worry, and liability to risk from the rulers or thieves."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mercury",
				"sublord" : "Ketu",
				"effect" : "Sloka 135. Trouble from relatives, mental agony, loss of comfort, dread of an enemy and failure in business are to be expected during Ketu's interval in Budha dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Moon",
				"sublord" : "Rahu",
				"effect" : "Sloka 76. During the antara of Rahu in the Moon's mahadasa, a person has to suffer distress on account of risks from foes and dangerous diseases, loss of relatives and waste of wealth; he has no ease in fact."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Venus",
				"sublord" : "Saturn",
				"effect" : "Sloka 165. Liaison with females that are past their prime, accession of houses, lands and wealth and the disappearance of enemies will mark Saturn's bhukti in Sukradasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Saturn",
				"sublord" : "Ketu",
				"effect" : "Sloka 125. Disease caused by wind and bile, quarrel with vile wicked people and dread of evil dreams. a person becomes liable to, during Ketu's interval in Saturn's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Venus",
				"sublord" : "Sun",
				"effect" : "Sloka 160. In the Sun's bhukti in the dasa of Venus, a person becomes liable to diseases affecting the head, the belly and the eyes; he sustains damage in respect to agriculture, cattle and property and incurs the displeasure of the rulers."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Ketu",
				"sublord" : "Sun",
				"effect" : "Sloka 148. Disappointment, physical pain, exile in a foreign country, peril and obstruction in every business are likely to crop up during the Sun's interval in Ketu's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mercury",
				"sublord" : "Rahu",
				"effect" : "Sloka 140. During Rahu's bhukti in Budha dasa, a person gets wealth from friends and relatives and secures to himself happiness, learning, ornaments and royal favor."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Sun",
				"sublord" : "Rahu",
				"effect" : "Sloka 65. Pang of death prematurely setting in, trouble from relatives as also from enemies, loss of place or mental misery may be expected in the bhukti of Rahu in the Sun's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Rahu",
				"sublord" : "Venus",
				"effect" : "Sloka 102. When Venus has its bhukti in Rahu dasa, there will be accession of vehicles, umbrellas, chowries and wealth of various sorts from foreign lands; but there may be trouble from diseases, foes and relatives."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Saturn",
				"sublord" : "Mercury",
				"effect" : "Sloka 124. Increase of happiness, wealth and fame, the benefits accruing from acts of piety and customary religious observances, agriculture and commerce, a person may expect to have in Mercury's interval in Saturn's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Jupiter",
				"sublord" : "Saturn",
				"effect" : "Sloka 112. A feeling of aversion, mental anguish, waste of wealth through the sons, failure of business are what a person may have to be prepared for during Saturn's interval in Jupiter's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Moon",
				"sublord" : "Sun",
				"effect" : "Sloka 82. Power almost regal, exemption from ailments, decadence of enemies, happiness and prosperity are what may be expected in the Sun's bhukti in the Moon's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Jupiter",
				"sublord" : "Sun",
				"effect" : "Sloka 116. Flight of enemies, victory, ease, great diligence, coming in of wealth, royal favor and sound health are what a person may expect in the Sun's interval in Jupiter's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mars",
				"sublord" : "Saturn",
				"effect" : "Sloka 88. Illness leading to much misery, evil threatened by enemies, robbers and kings and loss wealth are what a person has to put up with in the bhukti of Saturn in Mars' mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mars",
				"sublord" : "Jupiter",
				"effect" : "Sloka 87. Acquisition of wealth and lands through Brahmanas, freedom from illness, public esteem, ascendancy and happiness will mark Jupiter's interval in Mars' mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Moon",
				"sublord" : "Jupiter",
				"effect" : "Sloka 77. In the Moon's mahadasa and in Jupiter's apahara, a person will get vehicles and the like articles, abundance of clothing and ornaments. He will achieve what he strives for."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Mercury",
				"sublord" : "Venus",
				"effect" : "Sloka 136. Offering of acceptable presents to reverend seniors, gods, fire and the Brahmanas, observance of duty conformable to religion and morality, acquisition of wealth, clothing and ornaments will mark Sukra's interval in the dasa of Mercury."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Jupiter",
				"sublord" : "Moon",
				"effect" : "Sloka 117. Power acquired under female impulse, royal favor leading to material comforts, acquisition of fine apparel and ornaments, are what a person may look for in the Moon's interval in Jupiter's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Ketu",
				"sublord" : "Venus",
				"effect" : "Sloka 147. Illness of wife and children, quarrels, loss of relatives and friends, fever and dysentery are what one should be prepared for in Sukra's bhukti in Ketu dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Venus",
				"sublord" : "Mars",
				"effect" : "Sloka 162. Flow of bile, disease of the eyes, great exertion, coming in of money, acquisition of wives and lands are to be expected in Kuja's bhukti in the dasa of Venus."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Moon",
				"sublord" : "Saturn",
				"effect" : "Sloka 78. Mental anguish caused by a mother's suffering, wind and bilious affections, stiff words and discussion with unfriendly people are what a person has to be prepared for, in the apahara of Saturn, during the progress of the Moon's mahadasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Ketu",
				"sublord" : "Mars",
				"effect" : "Sloka 150. During Kuja's bhukti in Ketu dasa, a person has to incur the odium of his sons, wife and younger brothers, to suffer pain from diseases, foes and bad rulers, and lose some relatives."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Ketu",
				"sublord" : "Jupiter",
				"effect" : "Sloka 152. Approbation of Gods' Brahmanas and elders, king's good will, exemption from ailments and acquisition of lands and children may be looked for in Jupiter's bhukti in Ketu's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Rahu",
				"sublord" : "Mercury",
				"effect" : "Sloka 100. The society of friends, relatives, wife and children, accession of wealth and royal favor can be enjoyed during Mercury's bhukti in Rahu's dasa."
		},
		{
				"source" : "Jataka Parijata",
				"dasa" : "Vimsottari",
				"lord" : "Sun",
				"sublord" : "Moon",
				"effect" : "Sloka 63. When the Moon has its bhukti during the progress of Sun's dasa,a person will have accession of wealth through the instrumentality of relatives and friends, indulge in idle pastimes in the company of intimate and respectable people and suffer severely from jaundice and kindred ailments."
		},
	]
}
